app/Models/MainModel.php

INSERT INTO `contact_us` (`name`, `num`, `mail`, `subject`, `msge`, `contact_date`) VALUES ('test', '9876990534', 'malika@gmail.com', 'valid business', 'required', '2022-12-20')
---
    public function contact_insert($data)
    {
        $insert = array(
            'name' => $data['name'],
            'num' => $data['mobile'],
            'mail' => $data['email'],
            'subject' => $data['subject'],
            'msge' => $data['message'],
            'contact_date' => date("Y-m-d")
        );

        $query = $this->db->table('contact_us');
        $res = $query->insert($insert);